``` Terraform will perform the following actions:

  # aws_route53_record.grafana-usegalaxy will be updated in-place
  ~ resource "aws_route53_record" "grafana-usegalaxy" {
        id              = "Z386N8B8JBC6TQ_stats.galaxyproject.eu_A"
        name            = "stats.galaxyproject.eu"
      ~ records         = [
          - "192.52.32.145",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # openstack_compute_instance_v2.grafana must be replaced
-/+ resource "openstack_compute_instance_v2" "grafana" {
      ~ access_ip_v4        = "192.52.32.145" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "b2eaad59-55e5-482e-b984-55d20a862a3b" -> (known after apply)
      ~ id                  = "7c7d0517-7450-4239-913f-20d3005f638a" -> (known after apply)
      ~ image_id            = "6ffba012-69d4-4117-b9ee-9e6fa8a75a93" -> (known after apply)
        name                = "stats.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
        # (7 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "192.52.32.145" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:1e:b6:63" -> (known after apply)
          ~ name           = "public" -> "public-extended" # forces replacement
          + port           = (known after apply)
          ~ uuid           = "59342c0d-5f19-40c2-950b-b84cc1bcc591" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_volume_attach_v2.stats-data-vol1 must be replaced
-/+ resource "openstack_compute_volume_attach_v2" "stats-data-vol1" {
      ~ id          = "7c7d0517-7450-4239-913f-20d3005f638a/ad56f01f-cb21-458c-b1f9-90f937aa6525" -> (known after apply)
      ~ instance_id = "7c7d0517-7450-4239-913f-20d3005f638a" -> (known after apply) # forces replacement
      ~ region      = "Freiburg" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # openstack_compute_volume_attach_v2.stats-data-vol2 must be replaced
-/+ resource "openstack_compute_volume_attach_v2" "stats-data-vol2" {
      ~ id          = "7c7d0517-7450-4239-913f-20d3005f638a/254b499b-1293-4341-ba52-2901bbe56fcb" -> (known after apply)
      ~ instance_id = "7c7d0517-7450-4239-913f-20d3005f638a" -> (known after apply) # forces replacement
      ~ region      = "Freiburg" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```